name=[
    ["刘备","56","男","106","IBM",500,"50"],
      ["大乔","19","女","203","微软",501,"60"],
      ["小乔","19","女","210","Oracle",600,"60"],
      ["张飞","45", "男", "230", "Tencent", 700, "10"]
]
name_dict={}
for i in name:
    name_dict[i[0]]={"年龄":i[1],
                "性别":i[2],
                "编号":i[3],
                "任职公司":i[4],
                "薪资":i[5],
                "部门编号":i[6]
                     }
for i in name_dict:
    print(i,name_dict[i])


# name=[(1,'a'),(2,'b')]
# d1=dict(name)
# print(d1)